** 对列进行分组
   当Org导出表格时,默认是不导出表格中的竖线的,因为通常来说这不美观. 然而有时候竖线可用用来把表格划分为几个列的组(类似于水平分隔行把行划分为几个组别). 要定义列的组别,你可以使用一种特殊的行,在这一行里,第一个字段只包含'/'. 接下来的字段中可用包含'<'(表格这一列是一个组别的起始列),或者'>'(指示这一列是组别的结束列),或者'<>'('<'和'>'中间没有空格,这表示这一列自成一组). 组别之间的边界在导出时会用竖线标示出来.如下例子所示
   #+BEGIN_SRC org
     | N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
     |---+-----+-----+-----+---------+------------|
     | / |   < |     |   > |       < |          > |
     | 1 |   1 |   1 |   1 |       1 |          1 |
     | 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
     | 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
     |---+-----+-----+-----+---------+------------|
     #+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))
   #+END_SRC
   
   你也可以只是在想要竖线的地方插入列组的起始符号即可.例如
   #+BEGIN_SRC org
     |  N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
     |----+-----+-----+-----+---------+------------|
     | /  | <   |     |     | <       |            |
   #+END_SRC
*** 时长和时间的值
    如果你希望计算的是时间的值,你需要在Calc公式或Elisp公式中使用T标志
    #+BEGIN_SRC org
        |  Task 1 |   Task 2 |    Total |
        |---------+----------+----------|
        |    2:12 |     1:47 | 03:59:00 |
        | 3:02:20 | -2:07:00 |     0.92 |
        #+TBLFM: @2$3=$1+$2;T::@3$3=$1+$2;t
    #+END_SRC
    输入的时长值必须是以[HH:MM[:SS]]的形式的,这里秒数是可选的. 当使用了T标志,计算出来的时长会以HH:MM:SS的形式来显示(参考上面例子的第一个公式). 当使用t标志时,计算出来的时长的显示方式是根据变量'org-table-duration-custom-format'的不同而不同的, 该变量默认单位为小时并且会以小数的形式来显示结果(参考上面的第二个公式).

    Org也支持副的时长,而且数字在作加减法时会被认为是秒数.
*** 编辑和调试公式
    你可以在minibuffer或者直接在字段中编辑一个个的公式. Org也可以准备一个包含表格中所有公式的特殊缓存区. 当对公式进行编辑时,Org在可能的情况下会转换引用为标准格式(类似于B3或者D&这样的引用). 如果你想只使用引用内部格式(类似于@3$2或者$4),请配置变量'org-table-use-standard-references'

    * C-c = 或者 C-u C-c = (org-table-eval-formula) ::
         在minibuffer中编辑当前列/字段的公式. 参考[[列公式][列公式]]和[[字段公式和区间公式][字段公式和区间公式]].
    * C-u C-u C-c = (org-table-eval-formula) :: 
	 为当前字段重新设定一个公式(可以使字段公式也可以是列公式),使用这个命令你可以直接在字段中编辑公式. 与在minibuffer中编辑公式相比,这种方法的优势在于你可以使用命令C-c ?查询字段的信息.
    * C-c ? (org-table-field-info) :: 
	 当在表格字段中编辑公式时,高亮公式中鼠标所在位置的字段引用所引用的字段.
    * C-c } :: 
	       切换显示行列编号,using overlays(org-table-toggle-coordinate-overlays). 这些信息在每次表格重排之后都会自动更新;你也可以使用C-c C-c来强制更新信息.
    * C-c { :: 
	       切换开启或者关闭公式调试器(org-table-toggle-formula-debugger). 具体信息参考下面
    * C-c ' (org-table-edit-formulas) :: 
	 打开一个特殊的缓冲区(公式编辑器),可以在里面编辑当前表格所有的公式,在这个缓冲区中,每个公式都显示一行. 如果当前字段包含包含有一个激活的公式,公式编辑器中的光标会标示出它来. 当光标在这个特殊的缓冲区中时,Org会自动高亮任何光标位置的字段引用所引用的字段. 你可以在这个特殊缓冲区中使用下面这些命令来编辑,删除和新增公式
      * C-c C-c 或 C-x C-s (org-table-fedit-finish) ::
	   退出公式编辑器,并且保持修改后的公式. 如果加了C-u前缀,那么会对整个表格应用新修改的公式(表格中所有的公式都会被重新计算一遍,然后显示出来)
      * C-c C-q (org-table-fedit-abort) :: 
	   退出公式编辑器,而不做任何修改
      * C-c C-r (org-table-fedit-toggle-ref-type) :: 
	   对表格编辑器中的所有引用切换显示格式,在标准格式(类似于B3)和内部格式(类似于@3$2)间切换
      * <TAB> (org-table-fedit-lisp-indent) :: 
	   美化并缩进当前光标所在的Lisp公式. 当光标所在行包含有Lisp公式时,使用Emacs Lisp的规则来格式化公式. Another <TAB> collapses the formula back again. 在open formula(开放式公式??)中,<TAB>跟在Emacs Lisp mode一样起着重新缩进的功能.
      * M-<TAB> (lisp-complete-symbol) :: 
	   补完Lisp符号,就跟在Emacs Lisp mode中一样
      * S-<up>/<down>/<left>/<right> :: 
	   切换光标所在的引用. 例如如果现在光标所在的引用是B3,你按下S-<right>之后,该引用变成了C3. 这对相对引用和hline引用也有效
      * M-S-<up> (org-table-fedit-line-up) 或 M-S-<down> (org-table-fedit-line-down) :: 
	   上下移动Org buufer中行公式的test line
      * M-<up> (org-table-fedit-scroll-down) 或 M-<down> (org-table-fedit-scroll-up) :: 
	   滚动表格所在的窗口
      * C-c } :: 
		 显示/关闭表格中各个字段的坐标
    把一个字段清空并不会删掉这个字段的公式,因为公式实际上是保存在其他行(#_TBLFM行)-这样在下一次重新计算时,该字段又会有新的值初出现. 要删掉一个字段中的公式,你需要在编辑公式要求输入新公式时输入一个空回复,或者直接编辑#+TBLFM行

    你可以直接编辑'#+TBLFM'行,然后在该行运行C-c C-c来对改变后的公式进行重新计算.或者也可以在表格中执行普通的重计算命令.

    * 使用多个#+TBLFM行

    你可以应用多个临时公式.这样可以方便切换公式.在表格下面设置多个‘#+TBLFM’行,然后在公式上按下C-c C-c键来应用公式.下面是一个例子
    #+BEGIN_SRC org
    | x | y |
    |---+---|
    | 1 |   |
    | 2 |   |
    #+TBLFM: $2=$1*1
    #+TBLFM: $2=$1*2
    #+END_SRC
    在‘#+TBLFM: $2=$1*2’上按下C-c C-c产生:
    #+BEGIN_SRC org
    | x | y |
    |---+---|
    | 1 | 2 |
    | 2 | 4 |
    #+TBLFM: $2=$1*1
    #+TBLFM: $2=$1*2
    #+END_SRC
    Note: If you recalculate this table (with C-u C-c *, for example), you will get the following
    result of applying only the first ‘#+TBLFM’ line.
    #+BEGIN_SRC org
    | x | y |
    |---+---|
    | 1 | 1 |
    | 2 | 2 |
    #+TBLFM: $2=$1*1
    #+TBLFM: $2=$1*2
    #+END_SRC


    * 调试公式

    当公式的计算产生错误时,字段中的内容变为字符串'#ERROR'. 如果你想知道在变量替换和计算时都发生了什么以便寻找bug,你可以在Tbl菜单上打开公式调试功能然后重新对改公式计算一次(在字段中按下C-u C-u C-c = <RET>).随后就会显示详细信息出来.
*** 高级特性

    如果你想自动重计算字段的值,或者你向为字段和列分配名字[fn:表格8],你需要保留表格的第一列作存放特殊的标志字符.

    * C-# (org-table-rotate-recalc-marks) ::
         使第一列的标志字符在' ','#','*','!','$'这几个状态之间切换. 如果存在一个激活区域,则会改变该区域中所有的标志.

    下面的例子是一个记录学生考试成绩的表格,里面用到了这些特性:
    #+BEGIN_SRC org
      |---+---------+--------+--------+--------+-------+------|
      |   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
      |---+---------+--------+--------+--------+-------+------|
      | ! |         |     P1 |     P2 |     P3 |   Tot |      |
      | # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
      | ^ |         |     m1 |     m2 |     m3 |    mt |      |
      |---+---------+--------+--------+--------+-------+------|
      | # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
      | # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
      |---+---------+--------+--------+--------+-------+------|
      |   | Average |        |        |        |  29.7 |      |
      | ^ |         |        |        |        |    at |      |
      | $ | max=50  |        |        |        |       |      |
      |---+---------+--------+--------+--------+-------+------|
      #+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@-II..@-I);%.1f 
    #+END_SRC

    *注意事项*:请注意,对于这些特殊的表格来说,使用 C-u C-c *  来重计算表格,只对标记了'#'或'*'的行,和那些分配了公式的字段生效. 列公式对当第一个字段为空的行无效.

    这些标志字符的意义如下所示:
    * '!' ::
         该行的字段中的值为列的名称,因此你可以使用引用'$Tot'来代替'$6'
    * '^' :: 
	     这一行定义了上一行相应字段的名称. 有着这种定义,任何表格中的公式可以使用'$m1'来引用值'10'. 而且如果你为这个命名了的字段分配公式,该公式会被存储为'$name=...'的形式
    * '-' :: 
	     类似于'^',但是是为下一行的相应字段定义名字的.
    * '$' :: 
	     这一行的字段可以为公式定义参数. 举个例子,如果'$'行中的某个字段包含了'max=50',则表格中的公式可以使用'$max'来引用50这个值. 参数就好像是常量一样,所不同的是它们(参数)能够根据每个表格来定义.
    * '#' :: 
	     当在行中按下了<TAB>或<RET>或S-,TAB>,所有该标示的行中的字段会自动重新计算. 另外当使用全局重计算命令(C-u C-c * )时这些行也会进行重计算,而无标示的行则对该全局重计算命令无效.
    * '*' :: 
	     当使用全局重计算命令(C-u C-c * )时,该标志行也会进行重计算,但是该标志行并不会自动进行重计算. 当自动重计算功能会明显降低编辑效率时,该标志很有用.
    * ' ' :: 
	    无标志字符的行在使用C-u C-c * 进行重计算时并不会进行重计算. 只有标示了'#'或'*'的行才会重新计算.
    * '/' :: 
	     不导出带有该标志的行. 对那些包含了narrowing '<N>'标记(缩小的'<N>'标记)或列的分组标志很有用.

    最后,你可能会对使用梦幻般的'calc.el'包能实现那些功能很感兴趣, 下面是一个表格,它计算了the Taylor series of degree n at location x for a couple of functions. 
    #+BEGIN_SRC org
      |---+-------------+---+-----+--------------------------------------|
      |   | Func        | n | x   | Result                               |
      |---+-------------+---+-----+--------------------------------------|
      | # | exp(x)      | 1 | x   | 1 + x                                |
      | # | exp(x)      | 2 | x   | 1 + x + x^2 / 2                      |
      | # | exp(x)      | 3 | x   | 1 + x + x^2 / 2 + x^3 / 6            |
      | # | x^2+sqrt(x) | 2 | x=0 | x*(0.5 / 0) + x^2 (2 - 0.25 / 0) / 2 |
      | # | x^2+sqrt(x) | 2 | x=1 | 2 + 2.5 x - 2.5 + 0.875 (x - 1)^2    |
      | * | tan(x)      | 3 | x   | 0.0175 x + 1.77e-6 x^3               |
      |---+-------------+---+-----+--------------------------------------|
      #+TBLFM: $5=taylor($2,$4,$3);n3
    #+END_SRC

** Org绘图
   Org绘图可以利用保存在Org表格内的信息输出图形,也可以用ASCII-art表示图形.

   * 使用Gnuplot绘制图表

   通过使用Gnuplot [[http://www.gnuplot.info]] 和gnplot-mode http://xafs.org/BruceRavel/GnuplotMode ,Org-Plot可用根据表格中的数据生成2D和3D图表. 这里有一个例子: 首先确保你安装了Gnuplot和Gnuplot mode,然后对下面的表格使用C-c " g或者M-x org-plot/gnuplot <RET>.
   #+BEGIN_SRC org
     #+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
     | Sede      | Max cites | H-index |
     |-----------+-----------+---------|
     | Chile     |    257.72 |   21.39 |
     | Leeds     |    165.77 |   19.68 |
     | Sao Paolo |     71.00 |   11.50 |
     | Stockholm |    134.19 |   14.33 |
     | Morelia   |    257.56 |   17.67 |
   #+END_SRC

   注意,Org Plot会自动把表格的标题作为生成图表的标签. 通过表格前的#+PLOT:行,你还可以定义plot的标签,类型,内容和展示. 下面列出了完整的Org-plot选项. 更多的信息和例子请参考Org-plot教程[[http://orgmode.org/worg/org-tutorials/org-plot.html]]

   * Plot选项

   * set ::
           当绘图时,用于设置任何的gnuplot选项
   * title :: 
	   指定plot的标题
   * ind :: 
	   指定表格的哪一列作为x轴
   * deps :: 
	   指定描绘哪些列,该设置的格式类似于Lisp中的list,由小括号括起来,内部用空格分隔,例如'dep:(3 4)'指定只描绘第3,4列(默认情况下,除了指明为ind的列,其他的列都会被描绘)
   * type :: 
	   指定plot是2d还是3d还是grid的
   * with :: 
	   对每一个要被绘制的列都插入一个指定的with选项(例如,lines,points,boxes,impulses,等等). 默认值为lines
   * file :: 
	   如果你想将描绘输出成一个文件,指定输出文件的路径
   * labels :: 
	   用一个列表指定各输出列的标签(默认情况下,如果列的标题村爱的话,使用列标题作为标签)
   * line :: 
	   在gnuplot脚本中插入指定的一整行(Specify an entire line to be inserted in the Gnuplot script. )
   * map :: 
	   当描绘类型为3d或grid时,该选项的值设为t则在描绘时描绘的是一个平面映射而不是3维图形(set this to t to graph a flat mapping rather than a 3d slope)
   * timefmt :: 
	   指定Org-mode的时间戳格式,因为它们会被Gnuplot所解析,默认格式为'%Y-%m-%d-%H:%M:%S'
   * script :: 
	   如果你想实现完全的自定义,你可以指定一个脚本文件(把文件名放在双引号内)来实现描绘动作. 在正真描绘之前,这个特定脚本中的每个'$datafile'会被替换成生成的数据文件的实际路径. 注意:即使你设置了这个选项,你也可能仍然需要定义plot的type,因为这个选项会影响到生成的数据文件的内容.

   * ASCII指示条
   当光标在一个数据列内按下C-c " a 或者 M-x orgtbl-ascii-plot <RET>,将在新列内创建当前列的指示条图形.此图形通过一个列公式来实现.当数据源发生变化时,指示条图形可以通过刷新表格进行更新,例如按下 C-u C-c *.
   #+BEGIN_SRC org
   | Sede          | Max cites |              |
   |---------------+-----------+--------------|
   | Chile         |    257.72 | WWWWWWWWWWWW |
   | Leeds         |    165.77 | WWWWWWWh     |
   | Sao Paolo     |     71.00 | WWW;         |
   | Stockholm     |    134.19 | WWWWWW:      |
   | Morelia       |    257.56 | WWWWWWWWWWWH |
   | Rochefourchat |      0.00 |              |
   #+TBLFM: $3='(orgtbl-ascii-draw $2 0.0 257.72 12)
   #+END_SRC

   这个公式是一个elisp调用:
   #+BEGIN_SRC emacs-lisp
   (orgtbl-ascii-draw COLUMN MIN MAX WIDTH)
   #+END_SRC
   COLUMN     数据源列
   MIN MAX    显示的最小值和最大值,超出范围的数值显示为‘too small’ 或 ‘too large’.
   WIDTH      指示条列的宽度,默认为'12'.

